rprinz08/Walkino/hardware/walkera/xmega/variants/rx2635h/pins_arduino.h
/*
  pins_arduino.h - Pin definition functions for Arduino
  Part of Arduino - http://www.arduino.cc/

  Copyright (c) 2007 David A. Mellis

  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.

  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  Lesser General Public License for more details.

  You should have received a copy of the GNU Lesser General
  Public License along with this library; if not, write to the
  Free Software Foundation, Inc., 59 Temple Place, Suite 330,
  Boston, MA  02111-1307  USA

  Updated for 'xmega' core by bob frazier, S.F.T. Inc. - http://mrp3.com/
  
  Updated for 'RX2635H' by Richard Prinz, http://www.min.at/prinz

  X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   X M E G A   
  
  
  
  The xmega code mods make a considerable number of assumptions
  about the pin number assignments (as defined here):

  DEFAULT MAPPING ('DIGITAL_IO_PIN_SHIFT' NOT DEFINED)
  ----------------------------------------------------
  PORTD - digital 0-7
  PORTC - digital 8-15
  PORTR - digital 16-17 (built-in LED on PORTR pin 1, aka '17')
  PORTA - analog 0-7, digital 18-25

  SPI is on PORTC (pins 4-7)
  
  Serial is implemented on PORTE pins 2 (RX), 3 (TX)
  Serial2 on PORTD, pins 6 (RX), 7 (TX)
  (no flow control) 
  
  PORTD pin 4 is connected to a LED.  
  Pin 4 is the 'built-in' LED, defined as 'LED_BUILTIN', and is active HIGH.

  Your Mileage May Vary, depending on your board layout.  Some boards shift the
  digital pin assignments by 2 so that digital I/O pin 0 is PORTD Rx, pin 13 is PORTC SCK, just
  like the Arduino ATmega board.  Then they align the physical pins so that a regular Arduino shield
  will work, and assign PORTD 0-1 to 2 different digital I/O pin numbers (such as 20 and 21).

  To facilitate that specific change, uncomment the #define for 'DIGITAL_IO_PIN_SHIFT', below.
  Alternately you can create a separate version of this file with a different variant name,
  such as 'xmega-compat', with the #define uncommented, stored in an appropriately named directory.

  ============================
  HARDWARE SERIAL FLOW CONTROL
  ============================

  This version of the xmega Arduino startup+support files supports 
  HARDWARE FLOW CONTROL on the default serial port (PORTE) via
  RTS (output) and CTS (input). CTS is implemented as input from remote 
  device's DTR. RTS is implemented as DTR output.

  To implement RTS/CTS, use definitions similar to the following in your 
  version of this header file

  NOTE: RTS(DTR) will be configured as an output, active low 
        (high tells sender to stop sending data to the UART)
		
        CTS will be configured as an input, active low 
		(high stops data from being sent out via UART)

  CTS high to low transition causes an interrupt that may result 
  in serial I/O (for faster response time).

  // RTS(DTR) as GPIO 6 (port D pin 6)
  #define SERIAL_0_RTS_PORT_NAME PORTD
  #define SERIAL_0_RTS_PIN_INDEX 6

  // CTS as GPIO 7 (port D pin 7)
  #define SERIAL_0_CTS_PORT_NAME PORTD
  #define SERIAL_0_CTS_PIN_INDEX 7

*/





#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <avr/pgmspace.h>

// for now, the default xmega uses a simple assignment of digital pin numbers, 
// beginning with port D to accomodate a useful "compatibility" shield design, 
// these pins can be shifted so that the pin that maps to 'digitalRead(0)' 
// would be D2 rather than D0. This also puts 'Serial' on pins 0 and 1
// exactly like the Arduino UNO.  
// For any other mapping, create your own 'pins_arduino.h' file.
//

// UNCOMMENT THIS to shift digital pin assignments for Arduino 
// shield compatibility 
//#define DIGITAL_IO_PIN_SHIFT 


// NOTE: 'E' series can have analog inputs on PORTD. It can also support ARef 
// on PORTA pin 0, or PORTD pin 0
// @@@ see 24.14.3 in 'E' manual - this is the REFCTRL bits for the reference 
// @@@ select, AREF on PORTA (PA0)
#define USE_AREF					0x2 

#define NUM_DIGITAL_PINS            20


#ifdef USE_AREF
// could be 15 in an alternate version if I use PORTD as analog inputs
#define NUM_ANALOG_INPUTS           11

// PORTA pin 0 is not a valid input, so the first bit would be '1'
#ifdef analogInPinToBit
#undef analogInPinToBit
#endif

// analog pin 0 = 1 (PORTA), analog pin 7 = 0 (PORTD)
#define analogInPinToBit(P)			(((P) + 1) & 7) 

#else

// could be 16 in an alternate version if I use PORTD as analog inputs
#define NUM_ANALOG_INPUTS           12

#endif



#define analogInputToAnalogPin(p)	((p)-A0)
#define analogInputToDigitalPin(p)	((p < NUM_ANALOG_INPUTS) ? (p) + NUM_DIGITAL_PINS : -1)


// pins with PWM
// no shift:  0, 5-15
// shift:  3-6, 8-13, 16-17
//#ifdef DIGITAL_IO_PIN_SHIFT
//#define digitalPinHasPWM(p)         (((p) >= 3 && (p) <= 13 && (p) != 7) || (p) == 16 || (p) == 17)
//#else
#define digitalPinHasPWM(p)         ((p) == 0 || ((p) >= 5 && (p) <= 15))
//#endif


// the first macro, 'digitalPinToInterrupt', is for the 'interruptNum' 
// parameter in 'attachInterrupt' and 'detachInterrupt'
// the second macro, 'digitalPinToIntMode', is for the 'mode' 
// parameter in 'attachInterrupt'.
#define digitalPinToInterrupt(p) \
  { register uint8_t uiPort = pgm_read_byte((&digital_pin_to_port_PGM[p])); \
    uiPort == _PD ? PORTD_INT0 : uiPort == _PC ? PORTC_INT0 : uiPort == _PA ? PORTA_INT0 : uiPort == _PR ? PORTR_INT0 : -1; }

#define digitalPinToIntMode(p) ((uint16_t)(pgm_read_byte(&(digital_pin_to_bit_mask_PGM[p]))) << INT_MODE_PIN_SHIFT)


// xmega-specific - Interrupt 'vector number' assignments:

// Interrupts are PORT-SPECIFIC, not pin specific.
// pin 2 on any port is always asynchronous (except for 'R' which doesn't have a pin 2)
// all other pins can manage synchronous interrupts. 'wakeup' from sleep mode
// and other async interrupts must be on a 'pin 2', on ports A through E
//

#define PORTD_INT0					0
#define PORTD_INT1					1
#define PORTC_INT0					2
#define PORTC_INT1					3
#define PORTE_INT0					4
#define PORTE_INT1					5
#define PORTA_INT0					6
#define PORTA_INT1					7
#define PORTB_INT0					8
#define PORTB_INT1					9
#define PORTR_INT0					10
#define PORTR_INT1					11

// defined here instead of wiring_private.h
#define EXTERNAL_NUM_INTERRUPTS		12

// was in wiring_external.h, moved here
#define EXTERNAL_INT_0				0
#define EXTERNAL_INT_1				1
#define EXTERNAL_INT_2				2
#define EXTERNAL_INT_3				3
#define EXTERNAL_INT_4				4
#define EXTERNAL_INT_5				5
#define EXTERNAL_INT_6				6
#define EXTERNAL_INT_7				7
#define EXTERNAL_INT_8				8
#define EXTERNAL_INT_9				9
#define EXTERNAL_INT_10				10
#define EXTERNAL_INT_11				11


// xmega 'A' series has 2 sets of UART and SPI.
// The default UART is assigned on Port E, pins PE2-3
// The default SPI is assigned on Port C, pins PC4-7
//
// Standard GPIO pins are assigned as follows:
//
// PD0-7 Digital 0-7
// PC0-7 Digital 8-15
// PE0-3 Digital 16-19
//
// PA0-7 analog A0-A7
// PB0-3 analog A8-A11
//
// ALL PORT REMAP registers must be assigned to 0 (default mappings for pins)
// this puts PWM output on pins 0-3 for PORT E (the timers are split for C and D)
// Additionally, CLKOUT should be 0 (no clock outputs on any port/pin).
//
// TIMERS
// Timer TC4 should be configured as 'TC5' (for 8 PWM outputs) by default, essentially
// as a dual 8-bit timer, more or less compatible with the Arduino's 3 timers and
// supporting all 8 pins on port C for PWM output.  Port C's timer supports
// the system clock. Port D's timer has only PD5, so only pins 4-7 can be used for
// PWM output.  TD5 won't remap the pins at all to 0-4.
//
// See 'E' manual (chapter 13?) on TC4/5 and TD5 for more on this


// --------------------------------------------
// DEFINITIONS FOR SERIAL PORTS AND DEFAULT TWI
// --------------------------------------------

#define DEFAULT_TWI					TWIE
#define DEFAULT_SPI					SPIC
#define SPI_PORT                    SPIC

