rprinz08/Walkino/hardware/walkera/xmega/variants/rx2635h/pins_arduino.h
// serial port 0
#define SERIAL_0_PORT_NAME			PORTD
#define SERIAL_0_USART_NAME			USARTD1
#define SERIAL_0_USART_DATA			USARTD1_DATA
#define SERIAL_0_RXC_ISR			ISR(USARTD1_RXC_vect)
#define SERIAL_0_DRE_ISR			ISR(USARTD1_DRE_vect)
// define THIS to re-map the pins from PD6-7 to PC6-7
//#define SERIAL_0_REMAP			PORTD_REMAP 
// the bit needed to remap the port if SERIAL_0_REMAP is defined
#define SERIAL_0_REMAP_BIT			4   
// the pin number on the port, not the mapped digital pin number
#define SERIAL_0_RX_PIN_INDEX		6
// the pin number on the port, not the mapped digital pin number
#define SERIAL_0_TX_PIN_INDEX		7
#define USARTD1_VECTOR_EXISTS

// serial port 1
#define SERIAL_1_PORT_NAME			PORTC
#define SERIAL_1_USART_NAME			USARTC0
#define SERIAL_1_USART_DATA			USARTC0_DATA
#define SERIAL_1_RXC_ISR			ISR(USARTC0_RXC_vect)
#define SERIAL_1_DRE_ISR			ISR(USARTC0_DRE_vect)
// define THIS to re-map the pins from PC6-7 to PE2-3
//#define SERIAL_1_REMAP			PORTC_REMAP
// the bit needed to remap the port if SERIAL_1_REMAP
#define SERIAL_1_REMAP_BIT			4
// the pin number on the port, not the mapped digital pin number
#define SERIAL_1_RX_PIN_INDEX		2
// the pin number on the port, not the mapped digital pin number
#define SERIAL_1_TX_PIN_INDEX		3
#define USARTC0_VECTOR_EXISTS


// For atmega/Arduino Uno shield compatibility, with DIGITAL_IO_PIN_SHIFT defined,
// the typical board/pin layout might be like this (for shield pins):
//
// TWI is on TWIC (port C pins 0/1).  pins marked as '~' have PWM
//
//               M M
//             S I O   T R
//         A   C S S S x x
//     S S R G K O I S 2 2              T R
//     C D E N 1 1 1 1                  x x
//     L A F D 3 2 1 0 9 8  7 6 5 4 3 2 1 0
// ----o-o-o-o-o-o-o-o-o-o--o-o-o-o-o-o-o-o----
//     P P P   P P P P P P  P P P P P P P P
//     C C A   C C C C C C  D D D D D D D D
//     1 0 0   5 6 7 4 3 2  1 7 6 5 4 0 3 2
//     ~ ~     ~ ~ ~ ~ ~ ~    ~ ~ ~ ~
//
//               T O P   V I E W
//
//                           p
//               3   3       w  P P P P P P
//               V   V 5     r  A A A A A A
//               3   3 V     +  6 5 4 3 2 1
// ------------o-o-o-o-o-o-o-o--o-o-o-o-o-o----
//             U I R 3 5 G G V  A A A A A A
//             N O E . V N N i  5 4 3 2 1 0
//             U R S 3   D D n
//             S E E V
//             E F T
//             D
//
// RESERVED PINS (not brought out):  PA7, PR0, PD4 (connected to LED_BUILTIN)
//
// ARef should have a 100 ohm (or similar) resistor to Vcc with a decoupling capacitor
// IOREF must be connected to 3.3V so that compatible shields can detect 3.3V logic
// Vin connects to the 'power in' pin (may have 9V or more on this pin)
// 5V can be left unconnected, or use a separate voltage reg for 5V
// 3.3v must be regulated and able to supply 1A or more for shields.
//
// NOTE:  PA0 is connected to 'AREF', and PORTA pins are shifted to PA1 through PA6 for
//        A0 through A5.
//
// Uno has automatic switching between 5V reg out and 5V from USB power.  When Vin is more
// than 6.6v, the Vin source supplies 5V (and 3.3V) to the board.  otherwise, the USB
// 5V power supplies 5V (and 3.3V) to the board.
//
// NOTE:  on the E5, PC7 is MOSI, PC5 is SCK (it's the other way on the other CPUs)
//
// Summary Map:  D0   D1   D2   D3   D4   D5   D6   D7   D8   D9   D10  D11  D12  D13
//               PD2  PD3  PD0  PD4  PD5  PD6  PD7  PD1  PC2  PC3  PC4  PC7  PC6  PC5
//               Rx   Tx                                 Rx2  Tx2  SS   MOSI MISO SCK
//
//               A0   A1   A2   A3   A4   A5
//               PA1  PA2  PA3  PA4  PA5  PA6
//
// TWIC:  PC0 (SDA), PC1 (SCL)
// AREF:  PA0 (~10k to Vcc)
//
// ASYNC INTERRUPTS:  A1, D0, D8 (can be used for 'wakeup')
//

// default SPI
static const uint8_t SS   = 12;
static const uint8_t MOSI = 13;
static const uint8_t MISO = 14;
static const uint8_t SCK  = 15;

// primary SPI on PC4-7
static const uint8_t SS0   = 12;
static const uint8_t MOSI0 = 13;
static const uint8_t MISO0 = 14;
static const uint8_t SCK0  = 15;

// secondary SPI on PD4-7
static const uint8_t SS1   = 4;
static const uint8_t MOSI1 = 5;
static const uint8_t MISO1 = 6;
static const uint8_t SCK1  = 7;

// default 2-wire on PC0,PC1 - TWIC
static const uint8_t SDA = 8;
static const uint8_t SCL = 9;

// default 'status' LED on PD4
static const uint8_t LED_BUILTIN = 4;

// analog ports
static const uint8_t A0 = 20;
static const uint8_t A1 = 21;
static const uint8_t A2 = 22;
static const uint8_t A3 = 23;
static const uint8_t A4 = 24;
static const uint8_t A5 = 25;
static const uint8_t A6 = 26;
static const uint8_t A7 = 27;

static const uint8_t A8 = 28;
static const uint8_t A9 = 29;
static const uint8_t A10 = 30;
static const uint8_t A11 = 31;

// on the xmega 'E' series, PA2, PC2, and PD2 are asynchronous ints.  Others 
// are 'synchronous' which means that they must be held in their 
// 'interrupt state' long enough for the system to detect them. In any case
// all digital input pins can be use as interrupts, synchronous or otherwise.


#ifdef ARDUINO_MAIN

const uint16_t PROGMEM port_to_mode_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_DIR,       // PA
  (uint16_t) &PORTB_DIR,       // PB
  (uint16_t) &PORTC_DIR,       // PC
  (uint16_t) &PORTD_DIR,       // PD
  (uint16_t) &PORTE_DIR,       // PE
  NOT_A_PORT,                  // A series has no 'port R'
};

const uint16_t PROGMEM port_to_output_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_OUT,       // PA
  (uint16_t) &PORTB_OUT,       // PB
  (uint16_t) &PORTC_OUT,       // PC
  (uint16_t) &PORTD_OUT,       // PD
  (uint16_t) &PORTE_OUT,       // PE
  NOT_A_PORT,                  // A series has no 'port R'
};

const uint16_t PROGMEM port_to_input_PGM[] = {
  NOT_A_PORT,                  // 0
  (uint16_t) &PORTA_IN,        // PA
  (uint16_t) &PORTB_IN,        // PB
  (uint16_t) &PORTC_IN,        // PC
  (uint16_t) &PORTD_IN,        // PD
  (uint16_t) &PORTE_IN,        // PE
  NOT_A_PORT,                  // A series has no 'port R'
};

