rprinz08/Walkino/hardware/walkera/xmega/variants/rx2635h/pins_arduino.h
// xmega has a per-pin config register as well.
// Normally these will be:
//		00000111 for analog
//		00000000 for digital 'totem pole'
//		00011111 for 'INPUT_PULLUP'
// 
// bits 2:0 (trigger)
//		000 both edges
//		001 rising
//		010 falling
//		011 level
//		111 input buffer disabled
//
// NOTE: 'input buffer disabled' required to use the 'IN' register 
//			(so default here) also port R does not support 'INTPUT_DISABLED' 
//			so use BOTHEDGES [0] instead
//			
// bits 5:3 (out/pull)
//		000 TOTEM [normal],
//		001 bus keeper [sticky],
//		010 pulldown,
//		011 pullup,
//		100 wired 'or'
//		101 wired 'and'
//		110 wired 'or' pulldown
//		111 wired 'and' pullup
//
// bit 6: (invert logic) 
//		0 normal
//		1 inverted
//
// bit 7: (unused)
//		0 must be zero
//
// NOTE: PORTA through PORTE support 'input buffer disabled' and this setting 
//		is recommended for analog inputs.

const uint16_t PROGMEM digital_pin_to_control_PGM[] = {
	(uint16_t) &PORTD_PIN0CTRL,  // PD 0 ** 0 **
	(uint16_t) &PORTD_PIN1CTRL,  // PD 1 ** 1 **
	(uint16_t) &PORTD_PIN2CTRL,  // PD 2 ** 2 ** USARTD_RX		ASYNC
	(uint16_t) &PORTD_PIN3CTRL,  // PD 3 ** 3 ** USARTD_TX
	(uint16_t) &PORTD_PIN4CTRL,  // PD 4 ** 4 ** default LED
	(uint16_t) &PORTD_PIN5CTRL,  // PD 5 ** 5 **
	(uint16_t) &PORTD_PIN6CTRL,  // PD 6 ** 6 **
	(uint16_t) &PORTD_PIN7CTRL,  // PD 7 ** 7 **

	(uint16_t) &PORTC_PIN0CTRL,  // PC 0 ** 8 ** SDA
	(uint16_t) &PORTC_PIN1CTRL,  // PC 1 ** 9 ** SCL
	(uint16_t) &PORTC_PIN2CTRL,  // PC 2 ** 10 **				ASYNC
	(uint16_t) &PORTC_PIN3CTRL,  // PC 3 ** 11 **
	(uint16_t) &PORTC_PIN4CTRL,  // PC 4 ** 12 ** SPI_SS
	(uint16_t) &PORTC_PIN5CTRL,  // PC 5 ** 13 ** SPI_MOSI
	(uint16_t) &PORTC_PIN6CTRL,  // PC 6 ** 14 ** SPI_MISO
	(uint16_t) &PORTC_PIN7CTRL,  // PC 7 ** 15 ** SPI_SCK

	(uint16_t) &PORTE_PIN0CTRL,  // PE 0 ** 16 **
	(uint16_t) &PORTE_PIN1CTRL,  // PE 1 ** 17 **				ASYNC 
	(uint16_t) &PORTE_PIN2CTRL,  // PE 2 ** 18 **
	(uint16_t) &PORTE_PIN3CTRL,  // PE 3 ** 19 ** 

#ifndef USE_AREF
	// AREF (when USE_AREF is defined, and then it won't be mapped)
	(uint16_t) &PORTA_PIN0CTRL,  // PA 0 ** 20 ** A0
#endif
	(uint16_t) &PORTA_PIN1CTRL,  // PA 1 ** 21 ** A1
	(uint16_t) &PORTA_PIN2CTRL,  // PA 2 ** 22 ** A2			ASYNC
	(uint16_t) &PORTA_PIN3CTRL,  // PA 3 ** 23 ** A3
	(uint16_t) &PORTA_PIN4CTRL,  // PA 4 ** 24 ** A4
	(uint16_t) &PORTA_PIN5CTRL,  // PA 5 ** 25 ** A5
	(uint16_t) &PORTA_PIN6CTRL,  // PA 6 ** 26 ** A6
	(uint16_t) &PORTA_PIN7CTRL,  // PA 7 ** 27 ** A7
	
	(uint16_t) &PORTB_PIN0CTRL,  // PB 1 ** 28 ** A8
	(uint16_t) &PORTB_PIN1CTRL,  // PB 2 ** 29 ** A9			ASYNC
	(uint16_t) &PORTB_PIN2CTRL,  // PB 3 ** 30 ** A10
	(uint16_t) &PORTB_PIN3CTRL,  // PB 4 ** 31 ** A11
};

const uint8_t PROGMEM digital_pin_to_port_PGM[] = {
  // PORTLIST
  // -------------------------------------------
  _PD,  // PD 0 ** 0 **
  _PD,  // PD 1 ** 1 **
  _PD,  // PD 2 ** 2 ** USARTD_RX
  _PD,  // PD 3 ** 3 ** USARTD_TX
  _PD,  // PD 4 ** 4 ** default LED
  _PD,  // PD 5 ** 5 **
  _PD,  // PD 6 ** 6 **
  _PD,  // PD 7 ** 7 **
  
  _PC,  // PC 0 ** 8 ** SDA
  _PC,  // PC 1 ** 9 ** SCL
  _PC,  // PC 2 ** 10 **
  _PC,  // PC 3 ** 11 **
  _PC,  // PC 4 ** 12 ** SPI_SS
  _PC,  // PC 5 ** 13 ** SPI_MOSI
  _PC,  // PC 6 ** 14 ** SPI_MISO
  _PC,  // PC 7 ** 15 ** SPI_SCK
  
  _PE,  // PE 0 ** 16 **
  _PE,  // PE 1 ** 17 **
  _PE,  // PE 2 ** 18 **
  _PE,  // PE 3 ** 19 **
  
#ifndef USE_AREF
  _PA,  // PA 0 ** 20 ** A0
#endif
  _PA,  // PA 1 ** 21 ** A1
  _PA,  // PA 2 ** 22 ** A2
  _PA,  // PA 3 ** 23 ** A3
  _PA,  // PA 4 ** 24 ** A4
  _PA,  // PA 5 ** 25 ** A5
  _PA,  // PA 6 ** 26 ** A6
  _PA,  // PA 7 ** 27 ** A7
  
  _PB,  // PB 0 ** 28 ** A8
  _PB,  // PB 1 ** 29 ** A9
  _PB,  // PB 2 ** 30 ** A10
  _PB,  // PB 3 ** 31 ** A11
};

const uint8_t PROGMEM digital_pin_to_bit_mask_PGM[] = {
  // PIN IN PORT
  // -------------------------------------------
  _BV( 0 ),  // PD 0 ** 0 **
  _BV( 1 ),  // PD 1 ** 1 **
  _BV( 2 ),  // PD 2 ** 2 ** USARTD_RX
  _BV( 3 ),  // PD 3 ** 3 ** USARTD_TX
  _BV( 4 ),  // PD 4 ** 4 ** default LED
  _BV( 5 ),  // PD 5 ** 5 **
  _BV( 6 ),  // PD 6 ** 6 **
  _BV( 7 ),  // PD 7 ** 7 **
  
  _BV( 0 ),  // PC 0 ** 8 ** SDA
  _BV( 1 ),  // PC 1 ** 9 ** SCL
  _BV( 2 ),  // PC 2 ** 10 **
  _BV( 3 ),  // PC 3 ** 11 **
  _BV( 4 ),  // PC 4 ** 12 ** SPI_SS
  _BV( 5 ),  // PC 5 ** 13 ** SPI_MOSI
  _BV( 6 ),  // PC 6 ** 14 ** SPI_MISO
  _BV( 7 ),  // PC 7 ** 15 ** SPI_SCK
  
  _BV( 0 ),  // PE 0 ** 16 **
  _BV( 1 ),  // PE 1 ** 17 **
  _BV( 2 ),  // PE 2 ** 18 **
  _BV( 3 ),  // PE 3 ** 19 **
  
#ifndef USE_AREF
  _BV( 0 ),  // PA 0 ** 20 ** A0
#endif
  _BV( 1 ),  // PA 1 ** 21 ** A1
  _BV( 2 ),  // PA 2 ** 22 ** A2
  _BV( 3 ),  // PA 3 ** 23 ** A3
  _BV( 4 ),  // PA 4 ** 24 ** A4
  _BV( 5 ),  // PA 5 ** 25 ** A5
  _BV( 6 ),  // PA 6 ** 26 ** A6
  _BV( 7 ),  // PA 7 ** 27 ** A7
  
  _BV( 0 ),  // PB 0 ** 28 ** A8
  _BV( 1 ),  // PB 1 ** 29 ** A9
  _BV( 2 ),  // PB 2 ** 30 ** A10
  _BV( 3 ),  // PB 3 ** 31 ** A11
};


const uint8_t PROGMEM digital_pin_to_timer_PGM[] = {
  // TIMERS
  // -------------------------------------------
  // The timers on the E5 are a bit different than the others
  // Since TIMERD5 only goes tp PD4, PD5, PD6, PD7, I have to
  // map them to places that have PWM.

  TIMERD5,       // PD 0 ** 0 **
  TIMERD5,       // PD 1 ** 1 **
  TIMERD5,       // PD 2 ** 2 ** USARTD_RX
  TIMERD5,       // PD 3 ** 3 ** USARTD_TX
  TIMERD5,       // PD 4 ** 4 ** PWM 3
  TIMERD5,       // PD 5 ** 5 ** PWM 4
  TIMERD5,       // PD 6 ** 6 ** PWM 5
  TIMERD5,       // PD 7 ** 7 ** PWM 6
  
  TIMERC4,       // PC 0 ** 8 ** SDA
  TIMERC4,       // PC 1 ** 9 ** SCL
  TIMERC4,       // PC 2 ** 10 **
  TIMERC4,       // PC 3 ** 11 **
  TIMERC4,       // PC 4 ** 12 ** SPI_SS
  TIMERC4,       // PC 5 ** 13 ** SPI_MOSI
  TIMERC4,       // PC 6 ** 14 ** SPI_MISO
  TIMERC4,       // PC 7 ** 15 ** SPI_SCK
  
  NOT_ON_TIMER,  // PE 0 ** 16 **
  NOT_ON_TIMER,  // PE 1 ** 17 **
  NOT_ON_TIMER,  // PE 2 ** 18 **
  NOT_ON_TIMER,  // PE 3 ** 19 **

#ifndef USE_AREF
  NOT_ON_TIMER,  // PA 0 ** 20 ** A0
#endif
  NOT_ON_TIMER,  // PA 1 ** 21 ** A1
  NOT_ON_TIMER,  // PA 2 ** 22 ** A2
  NOT_ON_TIMER,  // PA 3 ** 23 ** A3
  NOT_ON_TIMER,  // PA 4 ** 24 ** A4
  NOT_ON_TIMER,  // PA 5 ** 25 ** A5
  NOT_ON_TIMER,  // PA 6 ** 26 ** A6
  NOT_ON_TIMER,  // PA 7 ** 27 ** A7
  
  NOT_ON_TIMER,  // PB 0 ** 28 ** A8
  NOT_ON_TIMER,  // PB 1 ** 29 ** A9
  NOT_ON_TIMER,  // PB 2 ** 30 ** A10
  NOT_ON_TIMER,  // PB 3 ** 31 ** A11
};
#endif


// These serial port names are intended to allow libraries and 
// architecture-neutral sketches to automatically default to the correct port 
// name for a particular type of use. For example, a GPS module would normally 
// connect to SERIAL_PORT_HARDWARE_OPEN, the first hardware serial port 
// whose RX/TX pins are not dedicated to another use.
//
// Port which normally prints to the Arduino Serial Monitor
// SERIAL_PORT_MONITOR
//
// Port which is USB virtual serial
// SERIAL_PORT_USBVIRTUAL
//
// Port which connects to a Linux system via Bridge library
// SERIAL_PORT_LINUXBRIDGE
//
// Hardware serial port, physical RX & TX pins.
// SERIAL_PORT_HARDWARE
//
// Hardware serial ports which are open for use.  Their RX & TX
// pins are NOT connected to anything by default.
// SERIAL_PORT_HARDWARE_OPEN

#define SERIAL_PORT_MONITOR			Serial
#define SERIAL_PORT_HARDWARE		Serial
#define SERIAL_HARDWARE_OPEN		Serial2

#endif

 
